// TODO: Добро пожаловать на модуль по HTML&CSS!
// Для начала давайте разберемся, что это такое и как это применяется.
// HTML — это язык гипертекстовой разметки, а CSS — формальный язык описания внешнего вида документа, написанного с помощью HTML.
// HTML нужен для описания веб-страниц с помощью обычного текста. С помощью него ты сможешь создавать и структурировать текст на сайте. Разделы, заголовки, ссылки и абзацы — все это относится к HTML.
// CSS применяется в сочетании с HTML и определяют внешний вид сайта. CSS отвечает за размер, цвет и положение всех элементов страницы, написанной на HTML.

// TODO: Почему тебе стоит пройти эту модуль?
// Курс разделен на небольшие уроки, где теории всего 20%. Ты будешь учиться на практике — в домашних заданиях, они составляют 80% этой программы. Смотри видео, выполняй задания и прикрепляй ссылки с решением в специальной форме ответа под уроком. Куратор примет твой ответ в ближайшее время, и тебе откроется правильное решение, чтобы ты мог проверить себя!

// Помимо знаний, которые ты получишь на курсе, ты можешь заработать монеты.

// Монеты — это валюта нашей школы. После завершения этого курса ты можешь обменять их на один из наших продуктов. Получается, ты не просто учишься, но еще и зарабатываешь! Подробнее о том, на что ты можешь потратить, читай в последнем уроке.

// TODO: Сколько можно заработать?
// 200 монет — за каждую выполненную домашнюю работу
// 100 монет — за правильное решение теста
// 250 монет — за приглашение друга, который сдаст 1-ю работу
// 300 монет — за отзыв в конце этого обучения
// 500 монет — за успешное завершение модуля
// Готов заработать свои первые монеты? Тогда подключай бота в Telegram, он пришлет тебе реферальную ссылку для друзей в течение 10 минут. Бота можно подключить только через приложение на компьютере или телефоне.

// TODO: Перейдем к делу и начнем постепенно погружаться в профессию
// Давай разберем основные термины. Так ты не запутаешься дальше и поймешь, что есть что.

// Веб-разработка — создание приложения, сайта или любой страницы, на которой ты сидишь в интернете. Разработка, как и любой большой процесс, делится на несколько этапов:

// веб-дизайн,
// верстка,
// программирование,
// иногда тестирование.

// Веб-дизайном занимаются специалисты по дизайну, а основы верстки ты как раз изучишь дальше в этом модуле.

// HTML-верстка — когда прописываешь с помощью языка гипертекстовой разметки (HTML) тексты, изображения, видео, расположение элементов и всё, что можно увидеть на странице.

// После верстки идёт веб-программирование, которое делится на две части:

// Backend отвечает за то, что происходит на сервере — вся внутренняя часть сайта или приложения, движок
// Frontend отвечает за интерфейс и внешний вид его элементов: кнопки, панели, заставки, счетчики и показ данных с backend

// Еще есть Fullstack, когда разработчик совмещает сразу две части.

// Backend-разработчики используют разные языки программирования: PHP, Python, JavaScript, Ruby, SQL, Go, Java и другие.

// Frontend, в который ты погружаешься прямо сейчас, гораздо проще — здесь балом правит исключительно JavaScript.

// С JavaScript можно быстро и легко войти в разработку. Это один из самых популярных языков программирования. На JS пишут сайты, его элементы и анимацию. Всё то, что ты видишь и на что кликаешь, когда сидишь в интернете — даже эту страницу сейчас. Когда ты заполняешь поля с контактами и нажимаешь кнопку «Подписаться», мгновенная реакция на это действие возможна благодаря коду, который написали на JavaScript.

// TODO:  Как работает Web
// Цель урока:

// 1). Понять, как концептуально работает Web
// 2). Узнать, что происходит при открытии сайта в браузере
// https://codepen.io/pen/tour/welcome/start
// https://developer.mozilla.org/ru/docs/Web/HTML/Element/Heading_Elements

// Шпаргалка по Emmet: https://docs.emmet.io/cheat-sheet/
